Revit 2027 API
KeyBasedTreeEntries Methods
The KeyBasedTreeEntries type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
FindEntry |  Finds the KeyBasedTreeEntry associated with the given key value.
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetEnumerator | Returns an enumerator that iterates through a collection.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetKeyBasedTreeEntriesIterator |  Returns a KeyBasedTreeEntriesIterator that iterates through the collection.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
KeyBasedTreeEntries Class
Autodesk.Revit.DB Namespace